/*******************************************************
* 名称 : 智能调光台灯
* 功能 : （1）靠的太近会提醒坐姿不正（蜂鸣器）
         （2）可手动调节台灯亮度
*********************************************************/
//头函数
#include <reg52.h>													   
#include <ADC0809.H>

//宏定义
#define uint unsigned int
#define uchar unsigned char	
#define DUAN P0				 //数码管段位						 	 
uchar pdata tt[51];		    //定义空数组用于AD0809取平均值
uchar scale=20;		//定义占空比比例
//位定义
bit bdata flag_auto,		//标志位
          ss,				//闪烁标志位
		    flag_bs,
		    flag_set,			//报警位标志位
		    flag_rsd,			//标志位
		    flag_jiejin=1;    //接近传感器标志位
uchar lum;					//ad0809读出值
int i;

//函数声明
void delay(uchar i);

sbit LED = P3^4;	//PWM输出
sbit change= P2^3;	//模式按键
sbit add = P2^1;	//加按键
sbit sub = P2^0;	//减按键
sbit jiejin=P3^5;   //接近开关
sbit buzz=P3^7;    //蜂鸣器开关

/*********************************************************
* 名称 : KEY();
* 功能 : 按键控制
*********************************************************/
void KEY()
{
	if(change==0)				  //按键按下
	{
		delay(10);				  //去抖
		if(change==0)			  //再次判断按键按下
		{
		
			buzz=0;				  //蜂鸣器鸣响
			flag_auto=!flag_auto; //标志位取反
			if(flag_auto==1)	  //当手动模式时  首先将LED发光比例PWM设置在50%
			scale=20;	
		}
		while(!change) ;buzz=1; //等待按键释放  松开按键后关闭蜂鸣器
	}
	if(jiejin==0&&flag_jiejin==1) //接近传感器检测到障碍时  开启报警
	{
		buzz=0;
		flag_jiejin=0;
	}
	if(jiejin!=flag_jiejin)	      //接近传感器检测不到障碍时  关闭报警
	{
		buzz=1;
		flag_jiejin=1;
	}
	if(flag_set==0)				 //手动模式下
	{
	
		if(add==0)				 //加键按下
		{
			delay(10);
			if(add==0)
			{
				scale++;		  //灯光比例++
				if(scale>=41)
				scale=41;	
			}
		}
		if(sub==0)				  //减键按下时
		{
			delay(10);
			if(sub==0)
			{
				scale--;		   //灯光比例--
				if(scale<1)
				scale=1;	
			}
		}
	}
}
/*********************************************************
* 名称 : init();
* 功能 : 初始化定时器
*********************************************************/

void init()
{
	TMOD=0x11;	   //工作方式1
	TH1=0x3c;
	TL0=0xe7;	   //T0赋初值25us	  
	ET0=1;
	ET1=1;		   //打开中断允许开关
	EA=1;		   //中断总开关
	TR0=1;		   //开定时器0 开关
	TR1=0;		   //关定时器0 开关
}
/*********************************************************
* 名称 : main();
* 功能 : 主函数
*********************************************************/
void main()
{
	init();		  //调用初始化函数
	flag_auto=1;  //初始化手动模式
	delay(500);	  //延时500ms后开机
	while(1)	  //大循环
	{
		KEY();		 //调用按键函数
	}
}

/********************************************************** 名称 : delay();
* 功能 : 延时函数：大约1ms
*********************************************************/
void delay(uchar i)
{
  uchar j,k; 
  for(j=i;j>0;j--)
    for(k=125;k>0;k--);
}

/*********************************************************
* 名称 : void time0() interrupt 1
* 功能 : 定时器T0 中断服务函数：PWM脉冲发生函数
*********************************************************/
void time0() interrupt 1
{
	uchar n;
	TH0=0xff;
	TL0=0xe7;		 //重新赋初值
	n++;			 //每25us  n++
	if(n>scale)		 //n大于设置比例时，打开灯
	{
		LED=1;
	}
	else if(n<=scale)//n小于等于设置比例时 关闭灯
	{
		LED=0;
	}
	if(n==40)		 //n==40  ：25us*40=1ms   1kHZ
	{
		n=0;		 //n=0
	}
	else ;	
}
